<a href="https://colab.research.google.com/github/minji-sung/pythonlab/blob/main/12_pandas%20etc.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
% cd /content/drive/MyDrive/Colab Notebooks

/content/drive/MyDrive/Colab Notebooks

In [ ]:
!pwd        #working directory

/content/drive/MyDrive/Colab Notebooks

In [ ]:
import pandas as pd
file1 = pd.read_excel('/content/drive/MyDrive/Colab Notebooks/상반기_제품_판매량_김민영(1_6).xlsx')
file1

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월
0  스마트폰  김민영  나  110  104  110  106  106  106
1    TV  김민영  나   60   65   62   68   66   60
2   냉장고  김민영  나   44   40   47   46   47   41

In [ ]:
file1.head()

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월
0  스마트폰  김민영  나  110  104  110  106  106  106
1    TV  김민영  나   60   65   62   68   66   60
2   냉장고  김민영  나   44   40   47   46   47   41

In [ ]:
file1.tail(1)

   제품명  담당자 지역  1월  2월  3월  4월  5월  6월
2  냉장고  김민영  나  44  40  47  46  47  41

In [ ]:
file1.shape

(3, 9)

In [ ]:
file1.describe()

               1월          2월          3월          4월          5월         6월
count    3.000000    3.000000    3.000000    3.000000    3.000000    3.00000
mean    71.333333   69.666667   73.000000   73.333333   73.000000   69.00000
std     34.428670   32.254199   32.908965   30.353473   30.116441   33.42155
min     44.000000   40.000000   47.000000   46.000000   47.000000   41.00000
25%     52.000000   52.500000   54.500000   57.000000   56.500000   50.50000
50%     60.000000   65.000000   62.000000   68.000000   66.000000   60.00000
75%     85.000000   84.500000   86.000000   87.000000   86.000000   83.00000
max    110.000000  104.000000  110.000000  106.000000  106.000000  106.00000

In [ ]:
file1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   제품명     3 non-null      object
 1   담당자     3 non-null      object
 2   지역      3 non-null      object
 3   1월      3 non-null      int64
 4   2월      3 non-null      int64
 5   3월      3 non-null      int64
 6   4월      3 non-null      int64
 7   5월      3 non-null      int64
 8   6월      3 non-null      int64
dtypes: int64(6), object(3)
memory usage: 344.0+ bytes

In [ ]:
# importing multiple excel files 

from pathlib import Path
from glob import glob

input_folder = '/content/drive/MyDrive/Colab Notebooks'
raw_data_dir = Path(input_folder)
excel_files = raw_data_dir.glob('*.xlsx')

for i in excel_files:
    print(i)

/content/drive/MyDrive/Colab Notebooks/상반기_제품_판매량_김민영(1_6).xlsx
/content/drive/MyDrive/Colab Notebooks/상반기_제품_판매량_이재정(1_6).xlsx
/content/drive/MyDrive/Colab Notebooks/상반기_제품_판매량_박준서(1_6).xlsx

In [ ]:
# 통합 프레임 생성

from pathlib import Path
from glob import glob

input_folder = '/content/drive/MyDrive/Colab Notebooks'
raw_data_dir = Path(input_folder)
excel_files = raw_data_dir.glob('*.xlsx')

total_df = pd.DataFrame() #empty data frame

for i in excel_files:
    df = pd.read_excel(i)
    total_df = total_df.append(df, ignore_index = True)

#df.append(): 행방향 통합

# 각 엑셀파일 데이터 가져와서
# 세로 방향으로 연결, 순차적으로 인덱스 증가 (기존 인덱스 무시)

total_df

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월
0  스마트폰  김민영  나  110  104  110  106  106  106
1    TV  김민영  나   60   65   62   68   66   60
2   냉장고  김민영  나   44   40   47   46   47   41
3  스마트폰  이재정  가  118  101  104  116  100  105
4    TV  이재정  가   62   61   60   66   61   66
5   냉장고  이재정  가   45   42   41   45   41   41
6  스마트폰  박준서  다  107  100  109  117  107  112
7    TV  박준서  다   65   65   60   69   65   66
8   냉장고  박준서  다   47   43   47   45   40   49

In [ ]:
# export excel files to working directory

folder = '/content/drive/MyDrive/Colab Notebooks/'
merged_excel_file = folder + '상반기_제품_판매량_통합.xlsx'

total_df.to_excel(merged_excel_file,
                  sheet_name = '상반기_제품_판매량_통합',
                  index = False)

print("생성파일:", merged_excel_file)

생성파일: /content/drive/MyDrive/Colab Notebooks/상반기_제품_판매량_통합.xlsx

In [ ]:
import pandas as pd

excel_file = './상반기_제품_판매량_통합.xlsx'

df = pd.read_excel(excel_file)
df

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월
0  스마트폰  김민영  나  110  104  110  106  106  106
1    TV  김민영  나   60   65   62   68   66   60
2   냉장고  김민영  나   44   40   47   46   47   41
3  스마트폰  이재정  가  118  101  104  116  100  105
4    TV  이재정  가   62   61   60   66   61   66
5   냉장고  이재정  가   45   42   41   45   41   41
6  스마트폰  박준서  다  107  100  109  117  107  112
7    TV  박준서  다   65   65   60   69   65   66
8   냉장고  박준서  다   47   43   47   45   40   49

In [ ]:

df[ df['제품명'] == '스마트폰']

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월
0  스마트폰  박준서  다  107  100  109  117  107  112

In [ ]:
df[df['제품명'].isin(['스마트폰', 'TV'])]

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월
0  스마트폰  김민영  나  110  104  110  106  106  106
1    TV  김민영  나   60   65   62   68   66   60
3  스마트폰  이재정  가  118  101  104  116  100  105
4    TV  이재정  가   62   61   60   66   61   66
6  스마트폰  박준서  다  107  100  109  117  107  112
7    TV  박준서  다   65   65   60   69   65   66

In [ ]:
#연산
#axis=1 == columns 
df_sum = df.sum(axis = 1)
df_sum

0    642
1    381
2    265
3    644
4    376
5    255
6    652
7    390
8    271
dtype: int64

In [ ]:
#axis = 0 == row 
df_sum1 = df.sum(axis=0)
df_sum1

제품명    스마트폰TV냉장고스마트폰TV냉장고스마트폰TV냉장고
담당자    김민영김민영김민영이재정이재정이재정박준서박준서박준서
지역                       나나나가가가다다다
1월                             658
2월                             621
3월                             640
4월                             678
5월                             633
6월                             646
dtype: object

In [ ]:
df['상반기 합계'] = df_sum
df['상반기합계'] = df_sum
df = df.drop('상반기 합계', axis = 1)
df

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월  상반기합계
0  스마트폰  김민영  나  110  104  110  106  106  106    642
1    TV  김민영  나   60   65   62   68   66   60    381
2   냉장고  김민영  나   44   40   47   46   47   41    265
3  스마트폰  이재정  가  118  101  104  116  100  105    644
4    TV  이재정  가   62   61   60   66   61   66    376
5   냉장고  이재정  가   45   42   41   45   41   41    255
6  스마트폰  박준서  다  107  100  109  117  107  112    652
7    TV  박준서  다   65   65   60   69   65   66    390
8   냉장고  박준서  다   47   43   47   45   40   49    271

In [ ]:
#데이터 연산 = 제품별 합계 구하기

excel_file = './data/상반기_제품_판매량_통합.xlsx'

df_prod = pd.read_excel(excel_file)

product_names = ['스마트폰', 'TV', '냉장고']

for product_names in product_names:
    df_prod_sum = product_sum(df_prod, product_name)
    print(df_prod_sum)

In [ ]:
df_filter = df[df['제품명']=='스마트폰']
df_filter

    제품명  담당자 지역   1월   2월   3월   4월   5월   6월  상반기합계
0  스마트폰  김민영  나  110  104  110  106  106  106    642
3  스마트폰  이재정  가  118  101  104  116  100  105    644
6  스마트폰  박준서  다  107  100  109  117  107  112    652

In [ ]:
df_filter_sum = df_filter.sum() #axis = 0 방향의 합
df_filter_sum

제품명      스마트폰스마트폰스마트폰
담당자         김민영이재정박준서
지역                나가다
1월                335
2월                305
3월                323
4월                339
5월                313
6월                323
상반기합계            1938
dtype: object

In [ ]:
df_filter_sum['제품명'] = '스마트폰'
df_filter_sum['담당자'] = '전체'
df_filter_sum['지역'] = '전체'
df_filter_sum

제품명      스마트폰
담당자        전체
지역         전체
1월        335
2월        305
3월        323
4월        339
5월        313
6월        323
상반기합계    1938
dtype: object

In [ ]:
import time
import random
def delay_print():
    time.sleep(0.5)
    print('    * ')
# 기본데이터
a =['성민지','노애정','이승은','김선민','박지원', '박지호', 
    '장민준', '남가연', '서윤선', '정진아', '노현정', '신동열',
    '한슬기', '이영이', '박정선', '김승아', '제경민', '최찬민', 
    '허윤희', '이동빈', '김혜원', '윤지선', '이지현', '이창익', 
    '전승혜', '강다솔', '김보연'] 
b=[]
i_text = 'y'
# 반복 처리 input
while i_text == 'y':
    if i_text != 'y':
        break
    i_text =input( '공정을 위해서 팀을 바꿔볼까요? (y/n) : ')
    time.sleep(1)
    random.shuffle(a)
    print(a)
# 사용자에게 보여주는 메세지 처리
print('그러면 팀 정하겠습니다. random.choice를 이용합니다!!! ')
for i in range(4):
    delay_print()
time.sleep(3)
print('진짜로 정합니다~')
delay_print()

# 순서 list 작성
for i in range(27):
    c = a.pop(a.index(random.choice(a)))
    b.append(c)
    n = random.randint(1,6)
    print(f'random.choice 결과 {c}님은 {n}팀의 팀원입니다')
    #time.sleep(2)
    # print(b,i)
# 결과 출력
print('*'* 50) 
print(b)

공정을 위해서 팀을 바꿔볼까요? (y/n) : n
['박지호', '전승혜', '성민지', '남가연', '이창익', '윤지선', '박정선', '이동빈', '최찬민', '서윤선', '노애정', '노현정', '허윤희', '신동열', '제경민', '박지원', '김선민', '이영이', '김보연', '이지현', '김승아', '강다솔', '한슬기', '이승은', '정진아', '장민준', '김혜원']
그러면 팀 정하겠습니다. random.choice를 이용합니다!!!
    *
    *
    *
    *
진짜로 정합니다~
    *
random.choice 결과 이지현님은 4팀의 팀원입니다
random.choice 결과 이창익님은 3팀의 팀원입니다
random.choice 결과 박지호님은 6팀의 팀원입니다
random.choice 결과 남가연님은 1팀의 팀원입니다
random.choice 결과 김보연님은 1팀의 팀원입니다
random.choice 결과 김선민님은 5팀의 팀원입니다
random.choice 결과 김혜원님은 4팀의 팀원입니다
random.choice 결과 제경민님은 6팀의 팀원입니다
random.choice 결과 윤지선님은 6팀의 팀원입니다
random.choice 결과 박정선님은 6팀의 팀원입니다
random.choice 결과 최찬민님은 2팀의 팀원입니다
random.choice 결과 전승혜님은 5팀의 팀원입니다
random.choice 결과 이승은님은 6팀의 팀원입니다
random.choice 결과 김승아님은 3팀의 팀원입니다
random.choice 결과 이동빈님은 2팀의 팀원입니다
random.choice 결과 박지원님은 2팀의 팀원입니다
random.choice 결과 신동열님은 6팀의 팀원입니다
random.choice 결과 한슬기님은 3팀의 팀원입니다
random.choice 결과 노현정님은 3팀의 팀원입니다
random.choice 결과 허윤희님은 1팀의 팀원입니다
random.choice 결과 장민준님은 1팀의 팀원입니다
random.choice 결과 성민지님은 6팀의 팀원입니다
random.choice 결과 강다솔님은 5팀의 팀원입니다
random.choice 결과 노애정님은 5팀의 팀원입니다
random.choice 결과 이영이님은 4팀의 팀원입니다
random.choice 결과 정진아님은 5팀의 팀원입니다
random.choice 결과 서윤선님은 5팀의 팀원입니다
**************************************************
['이지현', '이창익', '박지호', '남가연', '김보연', '김선민', '김혜원', '제경민', '윤지선', '박정선', '최찬민', '전승혜', '이승은', '김승아', '이동빈', '박지원', '신동열', '한슬기', '노현정', '허윤희', '장민준', '성민지', '강다솔', '노애정', '이영이', '정진아', '서윤선']

In [ ]:
import time
import random
def delay_print():
    time.sleep(0.5)
    print('    * ')
# 기본데이터
a =['성민지','노애정','이승은','김선민','박지원', '박지호', 
    '장민준', '남가연', '서윤선', '정진아', '노현정', '신동열',
    '한슬기', '이영이', '박정선', '김승아', '제경민', '최찬민', 
    '허윤희', '이동빈', '김혜원', '윤지선', '이지현', '이창익', 
    '전승혜', '강다솔', '김보연'] 
b=[]
i_text = 'y'
# 반복 처리 input
while i_text == 'y':
    if i_text != 'y':
        break
    i_text =input( '공정을 위해서 팀을 바꿔볼까요? (y/n) : ')
    time.sleep(1)
    random.shuffle(a)
    print(a)
# 사용자에게 보여주는 메세지 처리
print('그러면 팀 정하겠습니다. random.choice를 이용합니다!!! ')
for i in range(4):
    delay_print()
time.sleep(3)
print('진짜로 정합니다~')
delay_print()

# 순서 list 작성
for i in range(27):
    c = a.pop(a.index(random.choice(a)))
    b.append(c)
    n = random.randint(1,6)
    print(f'random.choice 결과 {c}님은 {n}팀의 팀원입니다')
    #time.sleep(2)
    # print(b,i)
# 결과 출력
print('*'* 50) 
print(b)

공정을 위해서 팀을 바꿔볼까요? (y/n) : n
['이승은', '노현정', '제경민', '노애정', '김승아', '전승혜', '성민지', '신동열', '이창익', '윤지선', '박지호', '최찬민', '강다솔', '김선민', '이지현', '박정선', '장민준', '이영이', '정진아', '한슬기', '남가연', '허윤희', '김보연', '박지원', '김혜원', '이동빈', '서윤선']
그러면 팀 정하겠습니다. random.choice를 이용합니다!!!
    *
    *
    *
    *
진짜로 정합니다~
    *
random.choice 결과 장민준님은 1팀의 팀원입니다
random.choice 결과 노현정님은 5팀의 팀원입니다
random.choice 결과 성민지님은 1팀의 팀원입니다
random.choice 결과 정진아님은 3팀의 팀원입니다
random.choice 결과 박지원님은 3팀의 팀원입니다
random.choice 결과 한슬기님은 6팀의 팀원입니다
random.choice 결과 이영이님은 5팀의 팀원입니다
random.choice 결과 이동빈님은 2팀의 팀원입니다
random.choice 결과 김혜원님은 3팀의 팀원입니다
random.choice 결과 이지현님은 4팀의 팀원입니다
random.choice 결과 김승아님은 3팀의 팀원입니다
random.choice 결과 박정선님은 6팀의 팀원입니다
random.choice 결과 이승은님은 5팀의 팀원입니다
random.choice 결과 김보연님은 1팀의 팀원입니다
random.choice 결과 박지호님은 4팀의 팀원입니다
random.choice 결과 최찬민님은 4팀의 팀원입니다
random.choice 결과 이창익님은 1팀의 팀원입니다
random.choice 결과 노애정님은 1팀의 팀원입니다
random.choice 결과 허윤희님은 6팀의 팀원입니다
random.choice 결과 남가연님은 1팀의 팀원입니다
random.choice 결과 강다솔님은 2팀의 팀원입니다
random.choice 결과 제경민님은 2팀의 팀원입니다
random.choice 결과 전승혜님은 3팀의 팀원입니다
random.choice 결과 서윤선님은 1팀의 팀원입니다
random.choice 결과 김선민님은 6팀의 팀원입니다
random.choice 결과 윤지선님은 4팀의 팀원입니다
random.choice 결과 신동열님은 6팀의 팀원입니다
**************************************************
['장민준', '노현정', '성민지', '정진아', '박지원', '한슬기', '이영이', '이동빈', '김혜원', '이지현', '김승아', '박정선', '이승은', '김보연', '박지호', '최찬민', '이창익', '노애정', '허윤희', '남가연', '강다솔', '제경민', '전승혜', '서윤선', '김선민', '윤지선', '신동열']

In [ ]:
import random
from collections import defaultdict
from math import ceil

# parameters
num_players = 27
groupsize = 5
max_group = ceil(num_players / groupsize)

# Setting up test data
#player = list(range(num_players)) # player represented by id
player = ['성민지','노애정','이승은','김선민','박지원', '박지호', 
    '장민준', '남가연', '서윤선', '정진아', '노현정', '신동열',
    '한슬기', '이영이', '박정선', '김승아', '제경민', '최찬민', 
    '허윤희', '이동빈', '김혜원', '윤지선', '이지현', '이창익', 
    '전승혜', '강다솔', '김보연'] 
random.shuffle(player)
d = defaultdict(list)

for i,e in enumerate(player):
    d[i % max_group].append(e)

print(list(d.values()))

[['허윤희', '박지원', '김승아', '강다솔', '이동빈'], ['전승혜', '김혜원', '박지호', '김선민', '정진아'], ['남가연', '노현정', '서윤선', '신동열', '윤지선'], ['박정선', '최찬민', '이영이', '성민지'], ['이승은', '장민준', '제경민', '노애정'], ['이창익', '한슬기', '이지현', '김보연']]

In [ ]:
import time
import random

members = ['박지호', '장민준', '남가연', '서윤선', '정진아',
           '김선민', '노애정', '박지원', '성민지', '이승은',
           '김승아', '제경민', '최찬민', '허윤희', '이동빈',
           '김혜원', '윤지선', '이지현', '이창익', '전승혜',
           '노현정', '신동열', '한슬기', '이영이', '박정선',
           '강다솔', '김보연']
text = input('팀 섞?(y/n) : ')
if text == 'y':
    print("random.choice를 이용하여 순서정하기")
    team_list = []
    for i in range(6):
        print(f'{i+1}팀 뽑겠습니다.')
        if i != 5:    
            for j in range(5):    
                name = members.pop(members.index(random.choice(members)))
                team_list.append(name)
        else:
            for j in range(3):    
                name = members.pop(members.index(random.choice(members)))
                team_list.append(name)
        print(f'{i+1}팀은 {team_list}입니다.')
        team_list = []

팀 섞?(y/n) : y
random.choice를 이용하여 순서정하기
1팀 뽑겠습니다.
1팀은 ['이동빈', '윤지선', '강다솔', '허윤희', '김승아']입니다.
2팀 뽑겠습니다.
2팀은 ['이승은', '박정선', '정진아', '전승혜', '김혜원']입니다.
3팀 뽑겠습니다.
3팀은 ['김선민', '서윤선', '노현정', '이지현', '박지호']입니다.
4팀 뽑겠습니다.
4팀은 ['김보연', '제경민', '남가연', '이창익', '이영이']입니다.
5팀 뽑겠습니다.
5팀은 ['성민지', '한슬기', '최찬민', '박지원', '장민준']입니다.
6팀 뽑겠습니다.

IndexError: ignored

In [ ]:
## 웹에서 테이블 가져오기
import pandas as pd

url = 'https://search.naver.com/search.naver?where=nexearch&sm=top_hty&fbm=1&ie=utf8&query=%ED%99%98%EC%9C%A8'

dfs = pd.read_html(url)
len(dfs)    #dataframe length

1

In [ ]:
dfs[0]

          통화명    매매기준율        전일대비     등락률
0      미국 USD  1117.50  전일대비하락1.50  -0.13%
1  일본 JPY 100  1015.77  전일대비하락4.52  -0.44%
2    유럽연합 EUR  1356.98  전일대비상승0.64  +0.05%
3      중국 CNY   174.56  전일대비상승0.05  +0.03%
4      영국 GBP  1576.79  전일대비하락1.84  -0.12%
5      호주 AUD   860.92  전일대비하락3.00  -0.35%
6     캐나다 CAD   921.04  전일대비상승0.54  +0.06%
7    뉴질랜드 NZD   799.01  전일대비하락1.02  -0.13%

In [ ]:
exchange_rate_df = dfs[0].replace({'전일대비하락': '▼',
                                    '전일대비상승':'🔺'}, regex = True)

exchange_rate_df

          통화명    매매기준율   전일대비     등락률
0      미국 USD  1117.50  ▼1.50  -0.13%
1  일본 JPY 100  1015.77  ▼4.52  -0.44%
2    유럽연합 EUR  1356.98  🔺0.64  +0.05%
3      중국 CNY   174.56  🔺0.05  +0.03%
4      영국 GBP  1576.79  ▼1.84  -0.12%
5      호주 AUD   860.92  ▼3.00  -0.35%
6     캐나다 CAD   921.04  🔺0.54  +0.06%
7    뉴질랜드 NZD   799.01  ▼1.02  -0.13%

In [ ]:
## 웹에서 테이블 가져오기
import pandas as pd

base_url = 'https://music.bugs.co.kr/chart/track/week/total?'
url = base_url + 'chartdate=20210614'
print(url)

dfs = pd.read_html(url)
len(dfs)    #dataframe length

dfs[0].head(5)

https://music.bugs.co.kr/chart/track/week/total?chartdate=20210614

   Unnamed: 0          순위  Unnamed: 2  ...         다운     영상     기타
0         NaN  1  1 계단 상승         NaN  ...  flac 다운로드  영상 재생  기타 기능
1         NaN  2  1 계단 하락         NaN  ...  flac 다운로드  영상 재생  기타 기능
2         NaN       3 HOT         NaN  ...  flac 다운로드  영상 재생  기타 기능
3         NaN  4  1 계단 하락         NaN  ...  flac 다운로드  영상 재생  기타 기능
4         NaN  5  1 계단 하락         NaN  ...  flac 다운로드  영상 재생  기타 기능

[5 rows x 13 columns]

In [ ]:
dfs[0]['순위'] = range(1, 101)

df_top100 = dfs[0][['순위', '곡', '아티스트']]
df_top100.head(5)

   순위              곡              아티스트
0   1     Next Level             aespa
1   2         Butter             방탄소년단
2   3   Alcohol-Free      TWICE (트와이스)
3   4     안녕 (Hello)          조이 (JOY)
4   5  Dun Dun Dance  오마이걸(OH MY GIRL)

In [ ]:
def bugs_chart_week_top100(year, month, day):
    
    #월과 일의 경우는 항상 두 자리로 맞춤
    
    month = "{0:02d}".format(month)
    day = "{0:02d}".format(day)
    base_url = 'https://music.bugs.co.kr/chart/track/week/total?'
    url = base_url + 'chartdate={0}{1}{2}'.format(year, month, day)
    
    #웹 사이트의 표 데이터를 DataFrame 데이터 리스트로 반환
    
    dfs = pd.read_hhtml(url)

    #내장 함수 range()를 이용해 순위 열에 1에서 100까지 할당
    
    dfs[0]['순위'] = range(1,101)
    
    #웹 사이트 표 데이터 중 원하는 열만 선택해 다른 변수에 지정
    
    df_top100 = dfs[0][['순위','곡','아티스트']]
    s_name = 'chartdate = {0}{1}{2}'.format(year, month, day)
    print(s_name)
    return df_top100,s_name

In [ ]:
import pandas as pd

# 벅스차트에서 연도, 월, 일을 지정해 주간 뮤직 차트(Top100)를 추출하는 함수
# 반환 결과: DataFrame 데이터
def bugs_chart_week_top100(year, month, day):
    # 월과 일의 경우는 항상 두 자리로 맞춤
    month = "{0:02d}".format(month) 
    day = "{0:02d}".format(day) 
    base_url = 'https://music.bugs.co.kr/chart/track/week/total?'        
    url = base_url + 'chartdate={0}{1}{2}'.format(year, month, day)
    # 웹 사이트의 표 데이터를 DataFrame 데이터 리스트로 반환
    dfs = pd.read_html(url) 
    # 내장 함수 range()를 이용해 순위 열에 1에서 100까지 할당
    dfs[0]['순위'] = range(1,101)

    # 웹 사이트 표 데이터 중 원하는 열만 선택해 다른 변수에 지정
    df_top100 = dfs[0][['순위', '곡', '아티스트']] 
    s_name = 'chartdate={0}{1}{2}'.format(year, month, day)
    print(s_name)
    return df_top100,s_name

In [ ]:

sheet_name1 = ' '
df,sheet_name1 =  bugs_chart_week_top100(2021,6,14)
df.head(10)
excel_file = "./data/벅스_차트_주간_Top100.xlsx"
df.to_excel(excel_file, sheet_name = sheet_name1, index= False)
print("생성파일: ", excel_file)